org-info/emacs_IDE/emacs_yasnippet-mode.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-04-16 Sun 13:51 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>yasnippet mode</title>
<meta name="generator" content="Org mode" />


</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../emacs.html"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><div id="content">
<h1 class="title">yasnippet mode</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org7c8f089">1. 为什么需要模板</a></li>
<li><a href="#orgb3c7ed2">2. 什么是yasnippet-mode</a></li>
<li><a href="#org430ef6f">3. 配置</a></li>
<li><a href="#org345ca9c">4. 使用</a></li>
</ul>
</div>
</div>
<p>
模板工具
</p>


<div id="outline-container-org7c8f089" class="outline-2">
<h2 id="org7c8f089"><span class="section-number-2">1</span> 为什么需要模板</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>减少重复工作, 提升效率</li>
<li>标准化</li>
</ul>
</div>
</div>
<div id="outline-container-orgb3c7ed2" class="outline-2">
<h2 id="orgb3c7ed2"><span class="section-number-2">2</span> 什么是yasnippet-mode</h2>
<div class="outline-text-2" id="text-2">
<p>
一个好用的快速模板工具
</p>
</div>
</div>
<div id="outline-container-org430ef6f" class="outline-2">
<h2 id="org430ef6f"><span class="section-number-2">3</span> 配置</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li><p>
下载yasnippet-mode
</p>
<pre class="example">
package-list-packages yasnippet-mode RET
</pre></li>

<li><p>
加载yasnippet-mode
</p>
<pre class="example">
(require 'yasnippet)
(yas-global-mode t)
</pre></li>

<li><p>
配置路径
</p>
<pre class="example">
;; 重载路径文件
(setq yas-snippet-dirs
  '("~/.emacs.d/yasnippets"))

;; 加载路径文件
(yas-load-directory "~/.emacs.d/yasnippets/")
</pre>
<p>
删掉了package中的 yasnippet-snippet包, 这样yasnippet-mode就会只使用自己写的模板
</p></li>

<li><p>
配置快捷键
</p>
<pre class="example">
(require 'yasnippet)

;; 使用hydra-mode管理yasnippet快捷键
(defhydra hydra-yas-minor (:color blue
			     :hint nil)
"
_j_: 扩展   _i_: 增加   _v_: 查看

"
("j" yas-expand)  ;;&lt;Tab&gt;仍可使用
("i" yas-new-snippet)
("v" yas-visit-snippet-file))

;;全局快捷键放到统一文件管理
;(global-set-key (kbd "C-;")  'hydra-yas-minor/body) ;;写入init-global-shortkey中
</pre></li>
</ol>
</div>
</div>

<div id="outline-container-org345ca9c" class="outline-2">
<h2 id="org345ca9c"><span class="section-number-2">4</span> 使用</h2>
<div class="outline-text-2" id="text-4">
<p>
以使用org-mode在hexo下写blog 举例
</p>
<pre class="example">
# 该处通过yasnippet命令自动生成, 声明了模板的名字name 和 模板相应的key
# -*- mode: snippet -*-
# name: hexo : hexo博客
# key: hexo
# --

# 此处使用了org-mode的元数据
#+BEGIN_COMMENT
| 名称       | 简述         | 取值               | 备注                 |
|------------+--------------+--------------------+----------------------|
| TITLE      | 标题         |                    |                      |
|------------+--------------+--------------------+----------------------|
| LAYOUT     | hexo排版模式 | post               |                      |
|------------+--------------+--------------------+----------------------|
| CATEGORIES | 分类仓库     | IDE, gnu, protocal |                      |
|            |              | system, tool       |                      |
|------------+--------------+--------------------+----------------------|
| TAGS       | 标签         |                    | gnu仓库的要打gun标签 |
|------------+--------------+--------------------+----------------------|
#+END_COMMENT

# 此处为org-mode 与 hexo交互的元数据
#+TITLE: ${1}
#+LAYOUT: post
#+CATEGORIES: ${2}
#+TAGS: ${3}

${4}

#+HTML: &lt;!-- more --&gt;
${5}

# 按tab可以方便的从${n} 到 ${n+1}
</pre>

<p>
当需要新开一篇文章的时候, 我只需要输入hexo, 然后按下TAB即可 :)
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2023-04-16 Sun 13:51</p>
<p class="validation"></p>
</div>
</body>
</html>
